{"id":1,"blurb":"## I'm offering tutoring services!\r\n\r\nI'm a skilled software developer with experience in a wide breadth of fields, ranging from Web Development, to Systems, and Artificial Intelligence, among others. I'm a skilled teacher and could assist with programming assignments, studying for exams,  and expanding your programming skill set!\r\n\r\nAs a third-year Computer Science Master's student, I've had a experience with many different aspects of software development, and have the ability to pick up new things quickly and easily. I am currently on track for a 1st class university degree as well. I also took Computer Science in the International Baccalaureate (**IB**), getting a 7 overall, also with a 7 in my IA.\r\n\r\nI'm highly available with a flexible schedule, so we can find whatever works best for you! Feel free to contact me at my email [tomas@premoli.org](mailto:tomas@premoli.org) for more details.","skills":"## My skills & experience\r\n\r\nI've been programming for over 5 years at this point, and due to that I've developed a breadth of experience in many different fields. Thanks to personal interest and my time at companies like Amazon, I've gotten to experience many aspects of Computer Science.\r\n\r\n### Backend\r\n\r\nI have experience developing backend for applications, using languages such as **Java**, **Python**, **C/C++**, and **PHP**. I have worked on web-based, desktop applications, and various command-line tools.\r\n\r\n### Frontend\r\n\r\nI have experience creating frontend for web applications, using tools such as **HTML**, **CSS**, and **JavaScript**. I also have experience with **React**, and have developed multiple sites using these tools.\r\n\r\n### Other skills\r\n\r\nI've been using **git** along with **GitHub** for the last few years, and have used these version control tools to store and document projects I've worked on. I have a lot of experience using **Object-Oriented Programming** (**OOP**) in my projects, and have a lot of experience in practices. Beyond that, I have a very strong foundation in **Data Structures & Algorithms**, having experience in studying and implementing many of them, in projects involving processes such as Huffman Encoding and Artificial Intelligence.","classes":"## Classes I've taken\r\n\r\n### First year:\r\n- Programming: 1st\r\n- Object-Oriented Programming: 1st\r\n- Computers and the Internet: 2:1\r\n- Data Structures and Algorithms: 1st\r\n- Discrete Mathematics for Computer Science: 1st\r\n- Computational Mathematics: 1st\r\n- Web Development: 1st\r\n\r\n### Second year:\r\n- Software Development: 1st\r\n- Computer Languages and Representations: 1st\r\n- Database Theory and Design: 1st\r\n- Artificial Intelligence and Applications: 1st\r\n- Network and Computer Security: 2:1\r\n- The C Family: 1st\r\n- Group Software Engineering Project: 1st\r\n\r\nTo see some of the projects I've worked on in both my own time and for school and university, check out my [portfolio](https://www.tomaspremoli.com/#/portfolio) or my [GitHub page](https://github.com/tpremoli)","pic":"https://d2421wmyymg4zq.cloudfront.net/api/media/me/tutoring_JaNoQUf.jpg"}